Revit 2026 API

# IFCProductWrapperAddSite Method

---

Adds a site (IfcObject) handle to associate with the IfcProduct in this wrapper.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void AddSite(
	IFCAnyHandle siteHandle
)
```
```vb
Public Sub AddSite (
	siteHandle As IFCAnyHandle
)
```
```cpp
public:
void AddSite(
	IFCAnyHandle^ siteHandle
)
```
```fsharp
member AddSite :
        siteHandle : IFCAnyHandle -> unit
```

#### Parameters

siteHandle IFCAnyHandle
     The site handle.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

IFCProductWrapper Class

Autodesk.Revit.DB.IFC Namespace